app/Helpers/custom_helper.php

    function get_general_settings()
    {
        $db = \Config\Database::connect();
        return $db->table('general_settings')->get()->getRow();
---
SELECT *
FROM `general_settings`

    function get_langguage_id($id)
    {
        $db = \Config\Database::connect();
        return  $db->table('languages')->getWhere(['id' => $id])->getRow();
---
SELECT *
FROM `languages`
WHERE `id` = '1'

    function get_translation_array($land_id)
    {
        $db = \Config\Database::connect();

        $translations = $db->table('language_translations')->getWhere(['lang_id' => $land_id])->getResult();
---
SELECT *
FROM `language_translations`
WHERE `lang_id` = '1'